# Apply & Map 관련
[데이터 마님 데이터 전처리 예제 - Apply & Map](https://www.datamanim.com/dataset/99_pandas/pandasMain.html#apply-map)
- 순서대로 Q56 ~ Q63

## 1번
데이터를 로드하고 데이터 행과 열의 갯수를 출력하라

In [15]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)
df.shape

(10127, 18)

In [2]:
df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816

## 2번
```
Income_Category의 카테고리를 map 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라 
Unknown : N
Less than $40K : a
$40K - $60K : b
$60K - $80K : c
$80K - $120K : d
$120K + : e
```

In [8]:
# df["Income_Category"].value_counts()
df["Income_Category"].unique()

array(['$60K - $80K', 'Less than $40K', '$80K - $120K', '$40K - $60K',
       '$120K +', 'Unknown'], dtype=object)

In [14]:
dic = {"Unknown" : "N", 
       "Less than $40K" : "a", 
       "$40K - $60K" : "b", 
       "$60K - $80K" : "c", 
       "$80K - $120K" : "d", 
       "$120K +" : "e"}

df["newIncome"] = df["Income_Category"].map(lambda x : dic[x])
df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,newIncome
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,c
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,a
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,d
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,a
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,c

## 3번
Income_Category의 카테고리를 apply 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라

In [16]:
def cat(x) :
    cat = ''
    if x == "Less than $40K" :
        cat = "a"
    elif x == "$40K - $60K" :
        cat = "b"
    elif x == "$60K - $80K" :
        cat = "c"
    elif x == "$80K - $120K" :
        cat = "d"
    elif x == "Unknown" :
        cat = "N"
    elif x == "$120K +" :
        cat = "e"
    return cat

df["newIncome"] = df["Income_Category"].apply(cat)
df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,newIncome
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,c
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,a
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,d
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,a
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,c

In [ ]:
# def changeCategory(x):
#     if x =='Unknown':
#         return 'N'
#     elif x =='Less than $40K':
#         return 'a'
#     elif x =='$40K - $60K':   
#         return 'b'
#     elif x =='$60K - $80K':    
#         return 'c'
#     elif x =='$80K - $120K':   
#         return 'd'
#     elif x =='$120K +' :     
#         return 'e'

# df['newIncome']  =df.Income_Category.apply(changeCategory)

# Ans = df['newIncome']

## 4번
Customer_Age의 값을 이용하여 나이 구간을 AgeState 컬럼으로 정의하라. (0~9 : 0 , 10~19 :10 , 20~29 :20 … 각 구간의 빈도수를 출력하라

In [17]:
df["AgeState"] = df["Customer_Age"] // 10 * 10
df["AgeState"].value_counts()

40    4561
50    2998
30    1841
60     530
20     195
70       2
Name: AgeState, dtype: int64

In [20]:
# map & lambda 이용

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv',index_col=0)

df["AgeState"] = df["Customer_Age"].map(lambda x : x // 10 * 10)
result = df['AgeState'].value_counts().sort_index()
result

20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: AgeState, dtype: int64

## 5번
Education_Level의 값중 Graduate단어가 포함되는 값은 1 그렇지 않은 경우에는 0으로 변경하여 newEduLevel 컬럼을 정의하고 빈도수를 출력하라

In [23]:
df["newEduLevel"] = df["Education_Level"].map(lambda x : 1 if 'Graduate' in x else 0)
df["newEduLevel"].value_counts()

0    6483
1    3644
Name: newEduLevel, dtype: int64

## 6번
Credit_Limit 컬럼값이 4500 이상인 경우 1 그외의 경우에는 모두 0으로 하는 newLimit 정의하라. newLimit 각 값들의 빈도수를 출력하라

In [24]:
# apply 함수 사용

def cat(x) :
    cat = ''
    if x >= 4500 :
        cat = 1
    else :
        cat = 0 
    return cat

df["newLimit"] = df["Credit_Limit"].apply(cat)
df["newLimit"].value_counts()

1    5096
0    5031
Name: newLimit, dtype: int64

In [25]:
# map & lambda 함수 사용

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)

df["newLimit"] = df["Credit_Limit"].map(lambda x : 1 if x >= 4500 else 0)
df["newLimit"].value_counts()

1    5096
0    5031
Name: newLimit, dtype: int64

## 7번
Marital_Status 컬럼값이 Married 이고 Card_Category 컬럼의 값이 Platinum인 경우 1 그외의 경우에는 모두 0으로 하는 newState컬럼을 정의하라. newState의 각 값들의 빈도수를 출력하라

### 조건이 여러개 일 때의 `apply` : df 기준으로 apply 적용 & axis(축) 명시해주기
- 칼럼 대상으로 하는 게 아니라, df.apply(함수, axis=1) 이렇게 !

In [32]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)

def check(x) :
    if (x["Marital_Status"] == "Married") & (x["Card_Category"] == "Platinum") :
        return 1
    else :
        return 0

df["newState"] = df.apply(check, axis=1)
df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64

In [27]:
def check(x):
    if x.Marital_Status =='Married' and x.Card_Category =='Platinum':
        return 1
    else:
        return 0

df['newState'] = df.apply(check,axis=1)
df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64

## 8번
Gender 컬럼값 M인 경우 male F인 경우 female로 값을 변경하여 Gender 컬럼에 새롭게 정의하라. 각 value의 빈도를 출력하라

In [39]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)
df["Gender"].value_counts()

F    5358
M    4769
Name: Gender, dtype: int64

In [41]:
# map & lamnda 이용

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)

dic = {"M" : "male", "F" : "female"}

df["Gender"] = df["Gender"].map(lambda x : dic[x])
df["Gender"].value_counts()

female    5358
male      4769
Name: Gender, dtype: int64

In [44]:
# apply 함수 이용

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv', index_col=0)

def changeGender(x):
    if x =='M':
        return 'male'
    else:
        return 'female'
df['Gender'] = df.Gender.apply(changeGender)
df['Gender'].value_counts()

female    5358
male      4769
Name: Gender, dtype: int64